benchmark_test_migrations/apr5_benchmark.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 33d2bef9-e4ad-48f3-9b55-d893e9b7764c-00-ft2ur0tp22md.worf.replit.dev (be patient).....done


Server Software:        
Server Hostname:        33d2bef9-e4ad-48f3-9b55-d893e9b7764c-00-ft2ur0tp22md.worf.replit.dev
Server Port:            443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_128_GCM_SHA256,2048,128
Server Temp Key:        ECDH P-521 521 bits
TLS Server Name:        33d2bef9-e4ad-48f3-9b55-d893e9b7764c-00-ft2ur0tp22md.worf.replit.dev

Document Path:          /
Document Length:        7134 bytes

Concurrency Level:      10
Time taken for tests:   1.711 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      734700 bytes
HTML transferred:       713400 bytes
Requests per second:    58.44 [#/sec] (mean)
Time per request:       171.104 [ms] (mean)
Time per request:       17.110 [ms] (mean, across all concurrent requests)
Transfer rate:          419.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       29   61  21.2     60     143
Processing:    61   96  17.1     95     167
Waiting:       61   88  11.0     90     117
Total:         99  157  25.7    153     262

Percentage of the requests served within a certain time (ms)
  50%    153
  66%    157
  75%    161
  80%    163
  90%    187
  95%    208
  98%    261
  99%    262
 100%    262 (longest request)